from flask import Flask, request, jsonify
from sentence_transformers import SentenceTransformer, util
from flask_cors import CORS

app = Flask(__name__)
CORS(app)   

# مدل سبک برای شباهت معنایی
model = SentenceTransformer("all-MiniLM-L6-v2")

# سوالات FAQ
faq_questions = [
    "سلام",
    "چطور از گیاهان آپارتمانی نگهداری کنم؟",
    "ساعات کاری فروشگاه چیه؟",
    "ارسال سفارش چقدر طول میکشه؟",
    "چه چیزهایی موجود دارین؟",
    "چطور خرید کنم؟" ,
    "چطور میتونم محصولاتتون رو ببینم؟" ,
    "قیمت کودهایتان چند است؟" , 
    "قیمت سم هایتان چند است؟" ,
    "قیمت گلدان هایتان چند است؟" , 
    "قیمت گیاه هایتان چند است؟" , 
    "قیمت خاک هایتان چند است؟" ,
    "شرایط نگهداری کود چیست؟" ,
    "شرایط نگهداری خاک چیست؟" ,
    "شرایط نگهداری سم ها چزور است؟" ,
    "محصولات سایتتون تخفیف هم داره؟" ,
    "ارسال محصولاتتون رایگان انجام میشه؟" ,
    "امکان مرجوع کردن کالا رو هم داره سایتتون؟" ,
    "چگونه می‌توانم گیاه مناسب برای خانه‌ام انتخاب کنم؟" ,
    "هر چند وقت یک بار باید به گیاهم آب بدهم؟" ,
    "چرا برگ‌های گیاهم زرد می‌شوند؟" ,
    "چه نوع خاکی برای گلدانم مناسب است؟" ,
    "آیا گیاهان آپارتمانی به کود نیاز دارند؟" ,
    "چطور گیاهانم را از شر آفات خلاص کنم؟" ,
    " آیا برای سفارش آنلاین، امکان ارسال به شهرستان‌ها وجود دارد؟" ,
    "چگونه می‌توانم مطمئن شوم که گیاه در شرایط سالمی به دستم می‌رسد؟" ,
    " بهترین زمان برای خرید گل و گیاه چه فصلی است؟" ,
    "چطور از گیاهانم در فصل زمستان مراقبت کنم؟" ,
    " چرا روی برگ‌های گیاهم لکه‌های قهوه‌ای یا سیاه ایجاد شده است؟" ,
    "چه زمانی باید از قارچ‌کش استفاده کنم؟" ,
    "اگر گیاه خریداری‌شده بعد از مدتی خشک شد یا از بین رفت، آیا شامل گارانتی می‌شود؟" ,
    "تشکر" ,
    "ممنون از راهنماییتون" ,
    "سپاس" ,
    "ممنون" ,
    "ممنون از شما" ,
    "مرسی" ,
    "گیاه مناسب برای نور کم چی پیشنهاد می‌کنین؟",
    "برای محل کار چه گلدونی بهتره؟",
    "چطور بفهمم گیاهم به آب نیاز داره؟",
    "آیا گیاهان برای حیوانات خانگی خطرناکن؟",
    "چطور گیاه رو تعویض گلدان کنم؟",
    "چه زمانی باید گلدان رو عوض کنم؟",
    "بهترین گیاه برای تصفیه هوا چیه؟",
    "چقدر طول میکشه تا بذر سبز بشه؟",
    "آیا بذرها تضمینی سبز میشن؟",
    "آیا میشه گیاه رو به عنوان هدیه سفارش داد؟",
    "می‌تونم سفارش رو در روز مشخصی دریافت کنم؟",
    "برای بالکن چه گیاه‌هایی مناسب‌ترن؟",
    "برای خونه‌ای که نور مستقیم داره چی پیشنهاد می‌کنین؟",
    "گیاهام دارن پژمرده میشن، مشکل چیه؟",
    "چه کود تقویتی برای رشد سریع مناسبه؟",
    "آیا کود مایع بهتره یا جامد؟",
    "آیا محصولات شما طبیعی هستن؟",
    "چطور مطمئن بشم گیاه اصل و سالمه؟",
    "آیا امکان خرید عمده دارین؟",
    "برای خرید عمده تخفیف میدین؟",
    "آیا امکان پرداخت در محل دارین؟",
    "روش‌های پرداخت چیه؟",
    "آیا میشه سفارش رو پیگیری کرد؟",
    "بسته‌بندی محصولاتتون چطوره؟",
    "اگه گیاه خشک شده به دستم رسید چی میشه؟",
    "چطور می‌تونم از گل‌های شاخه‌بریده مراقبت کنم؟",
    "آیا میشه گل‌ها رو با پیام اختصاصی هدیه داد؟",
    "آیا میشه رنگ گلدون رو انتخاب کرد؟",
    "برای نگهداری کاکتوس چه نکاتی لازمه؟",
    "آیا محصولات شما ضمانت کیفیت دارن؟"
    
]

faq_answers = [
    "سلام ، به سایت ما خیلی خوش آمدید",
    "گیاهان آپارتمانی را در نور کافی و با آب مناسب نگهداری کنید.",
    "ساعات کاری ما همه روزه از 9 صبح تا 8 شب است.",
    "ارسال سفارشات بین 1 تا 3 روز کاری انجام می‌شود.",
    "ما انواع گل های آپارتمانی ، گلدان های تریینی ، اواع سم و کود و انواع خاک را داریم." ,
    "می‌توانید با کلیک روی دکمه خرید در صفحه محصول، خرید خود را تکمیل کنید." , 
    "با رفتن به صفحه اصلی و کلیک بر روی مشاهده محصولات" ,
    "با رفتن به صفحه محصولات ، دسته بندی کود را انتخاب کرده و قیمت ها را ببینید." ,
    "با رفتن به صفحه محصولات ، دسته بندی سم را انتخاب کرده و قیمت ها را ببینید." ,
    "با رفتن به صفحه محصولات ، دسته بندی گلدان را انتخاب کرده و قیمت ها را ببینید." , 
    "با رفتن به صفحه محصولات ، دسته بندی گیاه را انتخاب کرده و قیمت ها را ببینید." , 
    "با رفتن به صفحه محصولات ، دسته بندی خاک را انتخاب کرده و قیمت ها را ببینید." ,
    "کود را باید در محیطی خشک، خنک و دور از نور مستقیم خورشید و رطوبت نگهداری کنید. برای جلوگیری از جذب رطوبت، بهتر است آن را در کیسه‌های اصلی خودش یا ظروف دربسته قرار دهید." ,
    "برای نگهداری خاک، آن را باید در مکانی خشک و خنک، دور از نور مستقیم خورشید و رطوبت قرار دهید. بهتر است خاک را در کیسه‌های اصلی خودش یا ظروف دربسته نگهداری کنید تا از ورود آفات و بیماری‌ها و تغییر کیفیت آن جلوگیری شود." ,
    "سموم باید در مکانی خشک، خنک و دارای تهویه مناسب و دور از نور مستقیم خورشید نگهداری شوند. همچنین برای جلوگیری از مسمومیت و خطرات احتمالی، باید آنها را در ظروف اصلی خود و در مکانی قفل‌دار و دور از دسترس کودکان، حیوانات و مواد غذایی قرار دهید." ,
    "اره ، تمامی محصولات سایت ما تخفیف داره." ,
    "خیر ، ارسال رایگان انجام نمیشه." ,
    "خیر ، سایت ما امکان مرجوع کردن رو نداره ." ,
    "به شرایط خانه‌تان مثل میزان نور، رطوبت و دمای محیط توجه کنید. برای مثال، اگر نور خانه‌تان کم است، گیاهانی مثل زامیفولیا، سانسوریا یا پتوس انتخاب‌های خوبی هستند." ,
    "زمان آبیاری به نوع گیاه و فصل بستگی دارد. بهترین راه این است که خاک گیاه را بررسی کنید؛ اگر سطح خاک تا عمق ۲ تا ۳ سانتی‌متری خشک بود، زمان آبیاری آن رسیده است." ,
    "زرد شدن برگ‌ها معمولاً به خاطر آبیاری زیاد یا کم است. عوامل دیگری مثل کمبود مواد مغذی، نور نامناسب یا بیماری‌ها نیز می‌توانند باعث این مشکل شوند." ,
    "برای اکثر گیاهان آپارتمانی، خاک با زهکشی خوب که ترکیبی از پیت ماس، پرلیت و کوکوپیت باشد، مناسب است. این ترکیب به ریشه‌ها اجازه تنفس می‌دهد و از پوسیدگی جلوگیری می‌کند" ,
    "بله، برای رشد بهتر گیاه، بهتر است در فصل‌های رشد (بهار و تابستان) هر دو تا چهار هفته یک بار از کود مایع مخصوص گیاهان آپارتمانی استفاده کنید." ,
    "ابتدا نوع آفت را شناسایی کنید. سپس می‌توانید از روش‌های طبیعی مانند اسپری آب و صابون یا روغن چریش استفاده کنید. در صورت شدت آفت، از سموم مخصوص گیاهان کمک بگیرید." ,
    "بله، ما به سراسر ایران ارسال داریم. برای اطلاع از جزئیات و هزینه‌ها، لطفاً در هنگام ثبت سفارش، آدرس خود را وارد کنید تا اطلاعات مربوط به ارسال نمایش داده شود." ,
    "ما گیاهان را در بسته‌بندی‌های مخصوص و مقاوم در برابر ضربه و تغییرات دمایی ارسال می‌کنیم. همچنین قبل از ارسال، سلامت کامل گیاه توسط کارشناسان ما بررسی می‌شود تا از سلامت آن اطمینان حاصل شود." ,
    "اگرچه در تمام فصول سال می‌توان گل و گیاه خرید، اما بهار و تابستان به دلیل شرایط نوری و دمایی بهتر، زمان ایده‌آلی برای خرید و سازگاری گیاه با محیط جدید است." ,
    "در فصل زمستان، رشد گیاهان کند می‌شود. آبیاری را کاهش دهید و از قرار دادن گیاهان در نزدیکی وسایل گرمایشی خودداری کنید. همچنین مطمئن شوید که نور کافی به آن‌ها می‌رسد." ,
    "این لکه‌ها معمولاً نشان‌دهنده آبیاری زیاد، بیماری‌های قارچی یا آفتاب‌سوختگی هستند. بررسی کنید که آیا نور مستقیم خورشید روی برگ‌ها می‌تابد یا خاک گیاه همیشه خیس است." ,
    "زمانی که روی برگ‌ها یا ساقه گیاه لکه‌های غیرعادی، کپک سفید یا نشانه‌هایی از پوسیدگی مشاهده کردید، بهتر است از قارچ‌کش استفاده کنید." ,
    "سلامت گیاه در زمان تحویل تضمین می‌شود. با این حال، به دلیل اینکه نگهداری از گیاه به عوامل محیطی زیادی بستگی دارد، شامل گارانتی پس از چند روز نمی‌شود. ما همیشه آماده ارائه مشاوره رایگان هستیم تا شما بتوانید گیاه خود را به بهترین نحو نگهداری کنید." ,
    "خواهش میکنم." ,
    "خواهش میکنم." ,
    "خواهش میکنم." ,
    "خواهش میکنم." ,
    "خواهش میکنم." ,
    "خواهش میکنم." ,
     "گیاهان مثل زامیفولیا و سانسوریا برای نور کم خیلی عالی هستن.",
    "برای محل کار گیاهان مقاوم مثل سانسوریا یا آگلونما پیشنهاد میشه.",
    "وقتی خاک گلدان ۲–۳ سانت خشک شد یعنی وقت آبیاریه.",
    "بعضی گیاهان مثل دیفن‌باخیا برای حیوانات سمی هستن، موقع خرید بپرسین.",
    "برای تعویض گلدان باید به آرامی گیاه رو خارج کرده و در خاک تازه بکارین.",
    "وقتی ریشه‌ها از زیر گلدان بیرون زدن زمان تعویض گلدانه.",
    "گیاهانی مثل فیکوس و پوتوس برای تصفیه هوا عالی هستن.",
    "معمولا بین ۷ تا ۲۱ روز زمان نیاز داره تا بذر سبز بشه.",
    "خیر، سبز شدن بذر به شرایط محیطی مثل نور و آب بستگی داره.",
    "بله، می‌تونین گیاه رو به همراه بسته‌بندی کادویی سفارش بدین.",
    "بله، کافیه هنگام ثبت سفارش تاریخ مورد نظرتون رو ذکر کنین.",
    "برای بالکن شمعدانی و حسن‌یوسف گزینه‌های خوبی هستن.",
    "گیاهانی مثل کاکتوس و آلوئه‌ورا نور مستقیم رو دوست دارن.",
    "پژمردگی ممکنه به دلیل آبیاری نامناسب یا کمبود نور باشه.",
    "کود NPK یا ورمی کمپوست برای رشد سریع عالیه.",
    "کود مایع جذب سریع‌تری داره ولی کود جامد ماندگاری بیشتری داره.",
    "بله، تمام محصولات طبیعی و سالم هستن.",
    "ما فقط گیاهان سالم و باکیفیت رو عرضه می‌کنیم.",
    "بله، امکان خرید عمده وجود داره.",
    "برای خرید عمده تخفیف ویژه در نظر گرفته میشه.",
    "بله، پرداخت در محل در بعضی شهرها فعال هست.",
    "پرداخت آنلاین و کارت به کارت در دسترسه.",
    "بله، با کد رهگیری می‌تونین سفارش رو پیگیری کنین.",
    "محصولات در بسته‌بندی ایمن و محکم ارسال میشن.",
    "در این صورت با پشتیبانی تماس بگیرین و جایگزین ارسال میشه.",
    "برای گل‌های شاخه‌بریده آب رو هر روز عوض کنید و ساقه‌ها رو کوتاه کنید.",
    "بله، امکان ارسال همراه با پیام اختصاصی وجود داره.",
    "بله، موقع خرید می‌تونین رنگ گلدون رو انتخاب کنید.",
    "کاکتوس‌ها به نور زیاد و آبیاری کم نیاز دارن.",
    "بله، کیفیت تمام محصولات تضمین میشه."
]

# بردارسازی سوالات FAQ
faq_embeddings = model.encode(faq_questions, convert_to_tensor=True)

@app.route("/chat", methods=["POST"])
def chat():
    data = request.json
    user_question = data.get("question", "")
    
    if not user_question:
        return jsonify({"answer": "سوالی دریافت نشد."})
    
    # بردارسازی سوال کاربر
    user_embedding = model.encode(user_question, convert_to_tensor=True)

    # شباهت‌ها
    similarities = util.cos_sim(user_embedding, faq_embeddings)[0]
    best_match_idx = int(similarities.argmax())
    best_score = float(similarities[best_match_idx])

    if best_score > 0.6:  # آستانه
        return jsonify({"answer": faq_answers[best_match_idx]})
    else:
        return jsonify({"answer": "متاسفم، پاسخی برای سوال شما پیدا نکردم."})

if __name__ == "__main__":
    app.run(port=5000, debug=True)
